Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.8.197/samg53/atdf/ATSAMG53N19.atdf
      <value-group caption="" name="ADC_MR__SLEEP">
        <value caption="Normal Mode: The ADC core and reference voltage circuitry are kept ON between conversions." name="NORMAL" value="0"/>
        <value caption="Sleep Mode: The ADC core and reference voltage circuitry are OFF between conversions." name="SLEEP" value="1"/>
      </value-group>
      <value-group caption="" name="ADC_MR__FREERUN">
        <value caption="Normal Mode" name="OFF" value="0"/>
        <value caption="Free Run Mode: Never wait for any trigger." name="ON" value="1"/>
      </value-group>
      <value-group caption="" name="ADC_MR__STARTUP">
        <value caption="0 periods of ADCCLK" name="SUT0" value="0x0"/>
        <value caption="8 periods of ADCCLK" name="SUT8" value="0x1"/>
        <value caption="16 periods of ADCCLK" name="SUT16" value="0x2"/>
        <value caption="24 periods of ADCCLK" name="SUT24" value="0x3"/>
        <value caption="64 periods of ADCCLK" name="SUT64" value="0x4"/>
        <value caption="80 periods of ADCCLK" name="SUT80" value="0x5"/>
        <value caption="96 periods of ADCCLK" name="SUT96" value="0x6"/>
        <value caption="112 periods of ADCCLK" name="SUT112" value="0x7"/>
        <value caption="512 periods of ADCCLK" name="SUT512" value="0x8"/>
        <value caption="576 periods of ADCCLK" name="SUT576" value="0x9"/>
        <value caption="640 periods of ADCCLK" name="SUT640" value="0xA"/>
        <value caption="704 periods of ADCCLK" name="SUT704" value="0xB"/>
        <value caption="768 periods of ADCCLK" name="SUT768" value="0xC"/>
        <value caption="832 periods of ADCCLK" name="SUT832" value="0xD"/>
        <value caption="896 periods of ADCCLK" name="SUT896" value="0xE"/>
        <value caption="960 periods of ADCCLK" name="SUT960" value="0xF"/>
      </value-group>
      <value-group caption="" name="ADC_MR__DIV1">
        <value caption="The PRESCAL field is used to generate the ADC clock unless DIV3 is written to 1." name="NO_DIV1" value="0"/>
        <value caption="The ADC clock equals peripheral clock (PRESCAL and DIV3 fields have no effect)." name="FORCE_DIV1" value="1"/>
      </value-group>
      <value-group caption="" name="ADC_MR__DIV3">
        <value caption="The PRESCAL field is used to generate the ADC clock unless DIV1 is written to 1." name="NO_DIV3" value="0"/>
        <value caption="The ADC clock equals peripheral clock/3 unless DIV1 is written to 1." name="FORCE_DIV3" value="1"/>
      </value-group>
      <value-group caption="" name="ADC_MR__USEQ">
        <value caption="Normal Mode: The controller converts channels in a simple numeric order depending only on the channel index." name="NUM_ORDER" value="0"/>
        <value caption="User Sequence Mode: The sequence respects what is defined in ADC_SEQR1 register and can be used to convert the same channel several times." name="REG_ORDER" value="1"/>
      </value-group>
      <value-group caption="" name="ADC_LCTMR__CMPMOD">
        <value caption="Generates an event when the converted data is lower than the low threshold of the window." name="LOW" value="0x0"/>
        <value caption="Generates an event when the converted data is higher than the high threshold of the window." name="HIGH" value="0x1"/>
        <value caption="Generates an event when the converted data is in the comparison window." name="IN" value="0x2"/>
        <value caption="Generates an event when the converted data is out of the comparison window." name="OUT" value="0x3"/>
      </value-group>
      <value-group caption="" name="ADC_EMR__CMPMODE">
        <value caption="Generates an event when the converted data is lower than the low threshold of the window." name="LOW" value="0x0"/>
        <value caption="Generates an event when the converted data is higher than the high threshold of the window." name="HIGH" value="0x1"/>
        <value caption="Generates an event when the converted data is in the comparison window." name="IN" value="0x2"/>
        <value caption="Generates an event when the converted data is out of the comparison window." name="OUT" value="0x3"/>
      </value-group>
      <value-group caption="" name="ADC_EMR__CMPTYPE">
        <value caption="Any conversion is performed and comparison function drives the COMPE flag." name="FLAG_ONLY" value="0"/>
        <value caption="Comparison conditions must be met to start the storage of all conversions until the CMPRST bit is set." name="START_CONDITION" value="1"/>
      </value-group>
      <value-group caption="" name="ADC_EMR__OSR">
        <value caption="No averaging. ADC sample rate is maximum." name="NO_AVERAGE" value="0x0"/>
        <value caption="1-bit enhanced resolution by averaging. ADC sample rate divided by 4." name="OSR4" value="0x1"/>
        <value caption="2-bit enhanced resolution by averaging. ADC sample rate divided by 16." name="OSR16" value="0x2"/>
      </value-group>
      <value-group caption="" name="ADC_EMR__ASTE">
        <value caption="The average requests several trigger events." name="MULTI_TRIG_AVERAGE" value="0"/>
        <value caption="The average requests only one trigger event." name="SINGLE_TRIG_AVERAGE" value="1"/>
      </value-group>
      <value-group caption="" name="ADC_EMR__SRCCLK">
        <value caption="The peripheral clock is the source for the ADC prescaler." name="PERIPH_CLK" value="0"/>
        <value caption="PMC PCKx is the source clock for the ADC prescaler, thus the ADC clock can be independent of the core/peripheral clock." name="PMC_PCK" value="1"/>
      </value-group>
      <value-group caption="" name="ADC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0" name="PASSWD" value="0x414443"/>
      </value-group>
    </module>
    <module name="CHIPID" caption="Chip Identifier" id="6417" version="Z">
      <register-group name="CHIPID">
        <register caption="Chip ID Register" name="CHIPID_CIDR" offset="0x0" rw="R" size="4">
          <bitfield caption="Version of the Device" mask="0x0000001F" name="VERSION"/>
          <bitfield caption="Embedded Processor" mask="0x000000E0" name="EPROC" values="CHIPID_CIDR__EPROC"/>
          <bitfield caption="Nonvolatile Program Memory Size" mask="0x00000F00" name="NVPSIZ" values="CHIPID_CIDR__NVPSIZ"/>
          <bitfield caption="Second Nonvolatile Program Memory Size" mask="0x0000F000" name="NVPSIZ2" values="CHIPID_CIDR__NVPSIZ2"/>
          <bitfield caption="Internal SRAM Size" mask="0x000F0000" name="SRAMSIZ" values="CHIPID_CIDR__SRAMSIZ"/>
          <bitfield caption="Architecture Identifier" mask="0x0FF00000" name="ARCH" values="CHIPID_CIDR__ARCH"/>
          <bitfield caption="Nonvolatile Program Memory Type" mask="0x70000000" name="NVPTYP" values="CHIPID_CIDR__NVPTYP"/>
          <bitfield caption="Extension Flag" mask="0x80000000" name="EXT"/>
        </register>
        <register caption="Chip ID Extension Register" name="CHIPID_EXID" offset="0x4" rw="R" size="4">
          <bitfield caption="Chip ID Extension" mask="0xFFFFFFFF" name="EXID"/>
        </register>
      </register-group>
      <value-group caption="" name="CHIPID_CIDR__EPROC">
        <value caption="ARM946ES" name="ARM946ES" value="0x1"/>
        <value caption="ARM7TDMI" name="ARM7TDMI" value="0x2"/>
        <value caption="Cortex-M3" name="CM3" value="0x3"/>
        <value caption="ARM920T" name="ARM920T" value="0x4"/>
        <value caption="ARM926EJS" name="ARM926EJS" value="0x5"/>
        <value caption="Cortex-A5" name="CA5" value="0x6"/>
        <value caption="Cortex-M4" name="CM4" value="0x7"/>
      </value-group>
