Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.8.197/samg53/atdf/ATSAMG53N19.atdf
        <register caption="Priority Register A for Slave 0" name="MATRIX_PRAS0" offset="0x0080" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
        </register>
        <register caption="Priority Register A for Slave 1" name="MATRIX_PRAS1" offset="0x0088" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
        </register>
        <register caption="Priority Register A for Slave 2" name="MATRIX_PRAS2" offset="0x0090" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
        </register>
        <register caption="Priority Register A for Slave 3" name="MATRIX_PRAS3" offset="0x0098" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
        </register>
        <register caption="System I/O Configuration Register" name="CCFG_SYSIO" offset="0x0114" rw="RW" size="4">
          <bitfield caption="PB4 or TDI Assignment" mask="0x00000010" name="SYSIO4"/>
          <bitfield caption="PB5 or TDO/TRACESWO Assignment" mask="0x00000020" name="SYSIO5"/>
          <bitfield caption="PB6 or TMS/SWDIO Assignment" mask="0x00000040" name="SYSIO6"/>
          <bitfield caption="PB7 or TCK/SWCLK Assignment" mask="0x00000080" name="SYSIO7"/>
          <bitfield caption="PB12 or ERASE Assignment" mask="0x00001000" name="SYSIO12"/>
        </register>
        <register caption="Write Protection Mode Register" name="MATRIX_WPMR" offset="0x1E4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="MATRIX_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="MATRIX_WPSR" offset="0x1E8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="" name="MATRIX_MCFG__ULBT">
        <value caption="No predicted end of burst is generated and therefore INCR bursts coming from this master cannot be broken." name="INFINITE" value="0x0"/>
        <value caption="The undefined length burst is treated as a succession of single access allowing rearbitration at each beat of the INCR burst." name="SINGLE" value="0x1"/>
        <value caption="The undefined length burst is split into a 4-beat bursts allowing rearbitration at each 4-beat burst end." name="FOUR_BEAT" value="0x2"/>
        <value caption="The undefined length burst is split into 8-beat bursts allowing rearbitration at each 8-beat burst end." name="EIGHT_BEAT" value="0x3"/>
        <value caption="The undefined length burst is split into 16-beat bursts allowing rearbitration at each 16-beat burst end." name="SIXTEEN_BEAT" value="0x4"/>
      </value-group>
      <value-group caption="" name="MATRIX_SCFG__DEFMSTR_TYPE">
        <value caption="At the end of current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in having a one cycle latency for the first access of a burst transfer or for a single access." name="NO_DEFAULT" value="0x0"/>
        <value caption="At the end of current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having the one cycle latency when the last master tries to access the slave again." name="LAST" value="0x1"/>
        <value caption="At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having the one cycle latency when the fixed master tries to access the slave again." name="FIXED" value="0x2"/>
      </value-group>
      <value-group caption="" name="MATRIX_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x4D4154"/>
      </value-group>
    </module>
    <module name="MEM2MEM" caption="Memory to Memory" id="11211" version="A">
      <register-group name="MEM2MEM">
        <register caption="Memory to Memory Transfer Holding Register" name="MEM2MEM_THR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Transfer Holding Data" mask="0xFFFFFFFF" name="THDATA"/>
        </register>
        <register caption="Memory to Memory Mode Register" name="MEM2MEM_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Transfer Size" mask="0x00000003" name="TSIZE" values="MEM2MEM_MR__TSIZE"/>
        </register>
        <register caption="Memory to Memory Interrupt Enable Register" name="MEM2MEM_IER" offset="0x08" rw="W" size="4" atomic-op="set:MEM2MEM_IMR">
          <bitfield caption="End of Transfer Interrupt Enable" mask="0x00000001" name="RXEND"/>
          <bitfield caption="Buffer Full Interrupt Enable" mask="0x00000002" name="RXBUFF"/>
        </register>
        <register caption="Memory to Memory Interrupt Disable Register" name="MEM2MEM_IDR" offset="0x0C" rw="W" size="4" atomic-op="clear:MEM2MEM_IMR">
          <bitfield caption="End of Transfer Interrupt Disable" mask="0x00000001" name="RXEND"/>
          <bitfield caption="Buffer Full Interrupt Disable" mask="0x00000002" name="RXBUFF"/>
        </register>
        <register caption="Memory to Memory Interrupt Mask Register" name="MEM2MEM_IMR" offset="0x10" rw="R" size="4" atomic-op="read:MEM2MEM_IMR">
          <bitfield caption="End of Transfer Interrupt Mask" mask="0x00000001" name="RXEND"/>
          <bitfield caption="Buffer Full Interrupt Mask" mask="0x00000002" name="RXBUFF"/>
        </register>
        <register caption="Memory to Memory Interrupt Status Register" name="MEM2MEM_ISR" offset="0x14" rw="R" size="4" atomic-op="read:MEM2MEM_ISR">
          <bitfield caption="End of Transfer" mask="0x00000001" name="RXEND"/>
          <bitfield caption="Buffer Full" mask="0x00000002" name="RXBUFF"/>
        </register>
        <register caption="Receive Pointer Register" name="MEM2MEM_RPR" offset="0x100" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register" name="MEM2MEM_RCR" offset="0x104" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
        <register caption="Transmit Pointer Register" name="MEM2MEM_TPR" offset="0x108" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0xFFFFFFFF" name="TXPTR"/>
        </register>
