Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.8.197/samg53/atdf/ATSAMG53N19.atdf
        <register caption="Interrupt Mask Register" name="PMC_IMR" offset="0x006C" rw="R" size="4" atomic-op="read:PMC_IMR">
          <bitfield caption="Main Crystal Oscillator Status Interrupt Mask" mask="0x00000001" name="MOSCXTS"/>
          <bitfield caption="PLLA Lock Interrupt Mask" mask="0x00000002" name="LOCKA"/>
          <bitfield caption="Master Clock Ready Interrupt Mask" mask="0x00000008" name="MCKRDY"/>
          <bitfield caption="Programmable Clock Ready 0 Interrupt Mask" mask="0x00000100" name="PCKRDY0"/>
          <bitfield caption="Programmable Clock Ready 1 Interrupt Mask" mask="0x00000200" name="PCKRDY1"/>
          <bitfield caption="Programmable Clock Ready 2 Interrupt Mask" mask="0x00000400" name="PCKRDY2"/>
          <bitfield caption="Main Oscillator Selection Status Interrupt Mask" mask="0x00010000" name="MOSCSELS"/>
          <bitfield caption="Main On-Chip RC Status Interrupt Mask" mask="0x00020000" name="MOSCRCS"/>
          <bitfield caption="Clock Failure Detector Event Interrupt Mask" mask="0x00040000" name="CFDEV"/>
        </register>
        <register caption="Fast Startup Mode Register" name="PMC_FSMR" offset="0x0070" rw="RW" size="4">
          <bitfield caption="Fast Startup Input Enable 0" mask="0x00000001" name="FSTT0"/>
          <bitfield caption="Fast Startup Input Enable 1" mask="0x00000002" name="FSTT1"/>
          <bitfield caption="Fast Startup Input Enable 2" mask="0x00000004" name="FSTT2"/>
          <bitfield caption="Fast Startup Input Enable 3" mask="0x00000008" name="FSTT3"/>
          <bitfield caption="Fast Startup Input Enable 4" mask="0x00000010" name="FSTT4"/>
          <bitfield caption="Fast Startup Input Enable 5" mask="0x00000020" name="FSTT5"/>
          <bitfield caption="Fast Startup Input Enable 6" mask="0x00000040" name="FSTT6"/>
          <bitfield caption="Fast Startup Input Enable 7" mask="0x00000080" name="FSTT7"/>
          <bitfield caption="Fast Startup Input Enable 8" mask="0x00000100" name="FSTT8"/>
          <bitfield caption="Fast Startup Input Enable 9" mask="0x00000200" name="FSTT9"/>
          <bitfield caption="Fast Startup Input Enable 10" mask="0x00000400" name="FSTT10"/>
          <bitfield caption="Fast Startup Input Enable 11" mask="0x00000800" name="FSTT11"/>
          <bitfield caption="Fast Startup Input Enable 12" mask="0x00001000" name="FSTT12"/>
          <bitfield caption="Fast Startup Input Enable 13" mask="0x00002000" name="FSTT13"/>
          <bitfield caption="Fast Startup Input Enable 14" mask="0x00004000" name="FSTT14"/>
          <bitfield caption="Fast Startup Input Enable 15" mask="0x00008000" name="FSTT15"/>
          <bitfield caption="RTT Alarm Enable" mask="0x00010000" name="RTTAL"/>
          <bitfield caption="RTC Alarm Enable" mask="0x00020000" name="RTCAL"/>
          <bitfield caption="Low-power Mode" mask="0x00100000" name="LPM"/>
          <bitfield caption="Flash Low-power Mode" mask="0x00600000" name="FLPM" values="PMC_FSMR__FLPM"/>
        </register>
        <register caption="Fast Startup Polarity Register" name="PMC_FSPR" offset="0x0074" rw="RW" size="4">
          <bitfield caption="Fast Startup Input Polarityx" mask="0x00000001" name="FSTP0"/>
          <bitfield caption="Fast Startup Input Polarityx" mask="0x00000002" name="FSTP1"/>
          <bitfield caption="Fast Startup Input Polarityx" mask="0x00000004" name="FSTP2"/>
          <bitfield caption="Fast Startup Input Polarityx" mask="0x00000008" name="FSTP3"/>
          <bitfield caption="Fast Startup Input Polarityx" mask="0x00000010" name="FSTP4"/>
          <bitfield caption="Fast Startup Input Polarityx" mask="0x00000020" name="FSTP5"/>
          <bitfield caption="Fast Startup Input Polarityx" mask="0x00000040" name="FSTP6"/>
          <bitfield caption="Fast Startup Input Polarityx" mask="0x00000080" name="FSTP7"/>
          <bitfield caption="Fast Startup Input Polarityx" mask="0x00000100" name="FSTP8"/>
          <bitfield caption="Fast Startup Input Polarityx" mask="0x00000200" name="FSTP9"/>
          <bitfield caption="Fast Startup Input Polarityx" mask="0x00000400" name="FSTP10"/>
          <bitfield caption="Fast Startup Input Polarityx" mask="0x00000800" name="FSTP11"/>
          <bitfield caption="Fast Startup Input Polarityx" mask="0x00001000" name="FSTP12"/>
          <bitfield caption="Fast Startup Input Polarityx" mask="0x00002000" name="FSTP13"/>
          <bitfield caption="Fast Startup Input Polarityx" mask="0x00004000" name="FSTP14"/>
          <bitfield caption="Fast Startup Input Polarityx" mask="0x00008000" name="FSTP15"/>
        </register>
        <register caption="Fault Output Clear Register" name="PMC_FOCR" offset="0x0078" rw="W" size="4">
          <bitfield caption="Fault Output Clear" mask="0x00000001" name="FOCLR"/>
        </register>
        <register caption="Write Protection Mode Register" name="PMC_WPMR" offset="0x00E4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="PMC_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="PMC_WPSR" offset="0x00E8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
        <register caption="Oscillator Calibration Register" name="PMC_OCR" offset="0x0110" rw="RW" size="4">
          <bitfield caption="RC Oscillator Calibration bits for 8 MHz" mask="0x0000007F" name="CAL8"/>
          <bitfield caption="Selection of RC Oscillator Calibration bits for 8 MHz" mask="0x00000080" name="SEL8"/>
          <bitfield caption="RC Oscillator Calibration bits for 16 MHz" mask="0x00007F00" name="CAL16"/>
          <bitfield caption="Selection of RC Oscillator Calibration bits for 16 MHz" mask="0x00008000" name="SEL16"/>
          <bitfield caption="RC Oscillator Calibration bits for 24 MHz" mask="0x007F0000" name="CAL24"/>
          <bitfield caption="Selection of RC Oscillator Calibration bits for 24 MHz" mask="0x00800000" name="SEL24"/>
        </register>
        <register caption="SleepWalking Enable Register 0" name="PMC_SLPWK_ER0" offset="0x114" rw="W" size="4" atomic-op="set:PMC_SLPWK_SR0">
          <bitfield caption="Peripheral 8 SleepWalking Enable" mask="0x00000100" name="PID8"/>
          <bitfield caption="Peripheral 9 SleepWalking Enable" mask="0x00000200" name="PID9"/>
          <bitfield caption="Peripheral 10 SleepWalking Enable" mask="0x00000400" name="PID10"/>
          <bitfield caption="Peripheral 11 SleepWalking Enable" mask="0x00000800" name="PID11"/>
          <bitfield caption="Peripheral 12 SleepWalking Enable" mask="0x00001000" name="PID12"/>
          <bitfield caption="Peripheral 13 SleepWalking Enable" mask="0x00002000" name="PID13"/>
          <bitfield caption="Peripheral 14 SleepWalking Enable" mask="0x00004000" name="PID14"/>
          <bitfield caption="Peripheral 15 SleepWalking Enable" mask="0x00008000" name="PID15"/>
          <bitfield caption="Peripheral 16 SleepWalking Enable" mask="0x00010000" name="PID16"/>
          <bitfield caption="Peripheral 17 SleepWalking Enable" mask="0x00020000" name="PID17"/>
          <bitfield caption="Peripheral 18 SleepWalking Enable" mask="0x00040000" name="PID18"/>
          <bitfield caption="Peripheral 19 SleepWalking Enable" mask="0x00080000" name="PID19"/>
          <bitfield caption="Peripheral 20 SleepWalking Enable" mask="0x00100000" name="PID20"/>
          <bitfield caption="Peripheral 21 SleepWalking Enable" mask="0x00200000" name="PID21"/>
          <bitfield caption="Peripheral 22 SleepWalking Enable" mask="0x00400000" name="PID22"/>
          <bitfield caption="Peripheral 23 SleepWalking Enable" mask="0x00800000" name="PID23"/>
          <bitfield caption="Peripheral 24 SleepWalking Enable" mask="0x01000000" name="PID24"/>
          <bitfield caption="Peripheral 25 SleepWalking Enable" mask="0x02000000" name="PID25"/>
          <bitfield caption="Peripheral 26 SleepWalking Enable" mask="0x04000000" name="PID26"/>
          <bitfield caption="Peripheral 27 SleepWalking Enable" mask="0x08000000" name="PID27"/>
          <bitfield caption="Peripheral 28 SleepWalking Enable" mask="0x10000000" name="PID28"/>
          <bitfield caption="Peripheral 29 SleepWalking Enable" mask="0x20000000" name="PID29"/>
        </register>
