Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.8.197/samg53/atdf/ATSAMG53N19.atdf
      <value-group caption="" name="RTC_MR__OUT1">
        <value caption="No waveform, stuck at '0'" name="NO_WAVE" value="0x0"/>
        <value caption="1 Hz square wave" name="FREQ1HZ" value="0x1"/>
        <value caption="32 Hz square wave" name="FREQ32HZ" value="0x2"/>
        <value caption="64 Hz square wave" name="FREQ64HZ" value="0x3"/>
        <value caption="512 Hz square wave" name="FREQ512HZ" value="0x4"/>
        <value caption="Output is a copy of the alarm flag" name="ALARM_FLAG" value="0x6"/>
      </value-group>
      <value-group caption="" name="RTC_SR__ACKUPD">
        <value caption="Time and calendar registers cannot be updated." name="FREERUN" value="0"/>
        <value caption="Time and calendar registers can be updated." name="UPDATE" value="1"/>
      </value-group>
      <value-group caption="" name="RTC_SR__ALARM">
        <value caption="No alarm matching condition occurred." name="NO_ALARMEVENT" value="0"/>
        <value caption="An alarm matching condition has occurred." name="ALARMEVENT" value="1"/>
      </value-group>
      <value-group caption="" name="RTC_SR__SEC">
        <value caption="No second event has occurred since the last clear." name="NO_SECEVENT" value="0"/>
        <value caption="At least one second event has occurred since the last clear." name="SECEVENT" value="1"/>
      </value-group>
      <value-group caption="" name="RTC_SR__TIMEV">
        <value caption="No time event has occurred since the last clear." name="NO_TIMEVENT" value="0"/>
        <value caption="At least one time event has occurred since the last clear." name="TIMEVENT" value="1"/>
      </value-group>
      <value-group caption="" name="RTC_SR__CALEV">
        <value caption="No calendar event has occurred since the last clear." name="NO_CALEVENT" value="0"/>
        <value caption="At least one calendar event has occurred since the last clear." name="CALEVENT" value="1"/>
      </value-group>
      <value-group caption="" name="RTC_SR__TDERR">
        <value caption="The internal free running counters are carrying valid values since the last read of the Status Register (RTC_SR)." name="CORRECT" value="0"/>
        <value caption="The internal free running counters have been corrupted (invalid date or time, non-BCD values) since the last read and/or they are still invalid." name="ERR_TIMEDATE" value="1"/>
      </value-group>
    </module>
    <module name="RTT" caption="Real-time Timer" id="6081" version="M">
      <register-group name="RTT">
        <register caption="Mode Register" name="RTT_MR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Real-time Timer Prescaler Value" mask="0x0000FFFF" name="RTPRES"/>
          <bitfield caption="Alarm Interrupt Enable" mask="0x00010000" name="ALMIEN"/>
          <bitfield caption="Real-time Timer Increment Interrupt Enable" mask="0x00020000" name="RTTINCIEN"/>
          <bitfield caption="Real-time Timer Restart" mask="0x00040000" name="RTTRST"/>
          <bitfield caption="Real-time Timer Disable" mask="0x00100000" name="RTTDIS"/>
          <bitfield caption="Real-Time Clock 1Hz Clock Selection" mask="0x01000000" name="RTC1HZ"/>
        </register>
        <register caption="Alarm Register" name="RTT_AR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Alarm Value" mask="0xFFFFFFFF" name="ALMV"/>
        </register>
        <register caption="Value Register" name="RTT_VR" offset="0x08" rw="R" size="4">
          <bitfield caption="Current Real-time Value" mask="0xFFFFFFFF" name="CRTV"/>
        </register>
        <register caption="Status Register" name="RTT_SR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Real-time Alarm Status (cleared on read)" mask="0x00000001" name="ALMS"/>
          <bitfield caption="Prescaler Roll-over Status (cleared on read)" mask="0x00000002" name="RTTINC"/>
        </register>
      </register-group>
    </module>
    <module name="SPI" caption="Serial Peripheral Interface" id="6088" version="ZE">
      <register-group name="SPI">
        <register caption="Control Register" name="SPI_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="SPI Enable" mask="0x00000001" name="SPIEN"/>
          <bitfield caption="SPI Disable" mask="0x00000002" name="SPIDIS"/>
          <bitfield caption="SPI Software Reset" mask="0x00000080" name="SWRST"/>
          <bitfield caption="Last Transfer" mask="0x01000000" name="LASTXFER"/>
        </register>
        <register caption="Mode Register" name="SPI_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Master/Slave Mode" mask="0x00000001" name="MSTR" values="SPI_MR__MSTR"/>
          <bitfield caption="Peripheral Select" mask="0x00000002" name="PS"/>
          <bitfield caption="Chip Select Decode" mask="0x00000004" name="PCSDEC"/>
          <bitfield caption="Mode Fault Detection" mask="0x00000010" name="MODFDIS"/>
          <bitfield caption="Wait Data Read Before Transfer" mask="0x00000020" name="WDRBT"/>
          <bitfield caption="Local Loopback Enable" mask="0x00000080" name="LLB"/>
          <bitfield caption="Peripheral Chip Select" mask="0x00030000" name="PCS" values="SPI_MR__PCS"/>
          <bitfield caption="Delay Between Chip Selects" mask="0xFF000000" name="DLYBCS"/>
        </register>
        <register caption="Receive Data Register" name="SPI_RDR" offset="0x08" rw="R" size="4">
          <bitfield caption="Receive Data" mask="0x0000FFFF" name="RD"/>
          <bitfield caption="Peripheral Chip Select" mask="0x000F0000" name="PCS"/>
        </register>
        <register caption="Transmit Data Register" name="SPI_TDR" offset="0x0C" rw="W" size="4">
          <bitfield caption="Transmit Data" mask="0x0000FFFF" name="TD"/>
          <bitfield caption="Peripheral Chip Select" mask="0x000F0000" name="PCS" values="SPI_TDR__PCS"/>
          <bitfield caption="Last Transfer" mask="0x01000000" name="LASTXFER"/>
        </register>
        <register caption="Status Register" name="SPI_SR" offset="0x10" rw="R" size="4">
          <bitfield caption="Receive Data Register Full (cleared by reading SPI_RDR)" mask="0x00000001" name="RDRF"/>
          <bitfield caption="Transmit Data Register Empty (cleared by writing SPI_TDR)" mask="0x00000002" name="TDRE"/>
          <bitfield caption="Mode Fault Error (cleared on read)" mask="0x00000004" name="MODF"/>
          <bitfield caption="Overrun Error Status (cleared on read)" mask="0x00000008" name="OVRES"/>
          <bitfield caption="End of RX buffer (cleared by writing SPI_RCR or SPI_RNCR)" mask="0x00000010" name="ENDRX"/>
          <bitfield caption="End of TX buffer (cleared by writing SPI_TCR or SPI_TNCR)" mask="0x00000020" name="ENDTX"/>
          <bitfield caption="RX Buffer Full (cleared by writing SPI_RCR or SPI_RNCR)" mask="0x00000040" name="RXBUFF"/>
          <bitfield caption="TX Buffer Empty (cleared by writing SPI_TCR or SPI_TNCR)" mask="0x00000080" name="TXBUFE"/>
          <bitfield caption="NSS Rising (cleared on read)" mask="0x00000100" name="NSSR"/>
          <bitfield caption="Transmission Registers Empty (cleared by writing SPI_TDR)" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Underrun Error Status (slave mode only) (cleared on read)" mask="0x00000400" name="UNDES"/>
          <bitfield caption="SPI Enable Status" mask="0x00010000" name="SPIENS"/>
        </register>
        <register caption="Interrupt Enable Register" name="SPI_IER" offset="0x14" rw="W" size="4" atomic-op="set:SPI_IMR">
          <bitfield caption="Receive Data Register Full Interrupt Enable" mask="0x00000001" name="RDRF"/>
          <bitfield caption="SPI Transmit Data Register Empty Interrupt Enable" mask="0x00000002" name="TDRE"/>
          <bitfield caption="Mode Fault Error Interrupt Enable" mask="0x00000004" name="MODF"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x00000008" name="OVRES"/>
          <bitfield caption="End of Receive Buffer Interrupt Enable" mask="0x00000010" name="ENDRX"/>
          <bitfield caption="End of Transmit Buffer Interrupt Enable" mask="0x00000020" name="ENDTX"/>
          <bitfield caption="Receive Buffer Full Interrupt Enable" mask="0x00000040" name="RXBUFF"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Enable" mask="0x00000080" name="TXBUFE"/>
          <bitfield caption="NSS Rising Interrupt Enable" mask="0x00000100" name="NSSR"/>
          <bitfield caption="Transmission Registers Empty Enable" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Underrun Error Interrupt Enable" mask="0x00000400" name="UNDES"/>
        </register>
        <register caption="Interrupt Disable Register" name="SPI_IDR" offset="0x18" rw="W" size="4" atomic-op="clear:SPI_IMR">
          <bitfield caption="Receive Data Register Full Interrupt Disable" mask="0x00000001" name="RDRF"/>
          <bitfield caption="SPI Transmit Data Register Empty Interrupt Disable" mask="0x00000002" name="TDRE"/>
          <bitfield caption="Mode Fault Error Interrupt Disable" mask="0x00000004" name="MODF"/>
          <bitfield caption="Overrun Error Interrupt Disable" mask="0x00000008" name="OVRES"/>
          <bitfield caption="End of Receive Buffer Interrupt Disable" mask="0x00000010" name="ENDRX"/>
          <bitfield caption="End of Transmit Buffer Interrupt Disable" mask="0x00000020" name="ENDTX"/>
          <bitfield caption="Receive Buffer Full Interrupt Disable" mask="0x00000040" name="RXBUFF"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Disable" mask="0x00000080" name="TXBUFE"/>
          <bitfield caption="NSS Rising Interrupt Disable" mask="0x00000100" name="NSSR"/>
          <bitfield caption="Transmission Registers Empty Disable" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Underrun Error Interrupt Disable" mask="0x00000400" name="UNDES"/>
        </register>
