Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.8.197/samg53/atdf/ATSAMG53N19.atdf
      <value-group caption="" name="TC_CMR0__EEVTEDG">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Rising edge" name="RISING" value="0x1"/>
        <value caption="Falling edge" name="FALLING" value="0x2"/>
        <value caption="Each edges" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__EEVT">
        <value caption="TIOB" name="TIOB" value="0x0"/>
        <value caption="XC0" name="XC0" value="0x1"/>
        <value caption="XC1" name="XC1" value="0x2"/>
        <value caption="XC2" name="XC2" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__WAVSEL">
        <value caption="UP mode without automatic trigger on RC Compare" name="UP" value="0x0"/>
        <value caption="UPDOWN mode without automatic trigger on RC Compare" name="UPDOWN" value="0x1"/>
        <value caption="UP mode with automatic trigger on RC Compare" name="UP_RC" value="0x2"/>
        <value caption="UPDOWN mode with automatic trigger on RC Compare" name="UPDOWN_RC" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__ACPA">
        <value caption="NONE" name="NONE" value="0x0"/>
        <value caption="SET" name="SET" value="0x1"/>
        <value caption="CLEAR" name="CLEAR" value="0x2"/>
        <value caption="TOGGLE" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__ACPC">
        <value caption="NONE" name="NONE" value="0x0"/>
        <value caption="SET" name="SET" value="0x1"/>
        <value caption="CLEAR" name="CLEAR" value="0x2"/>
        <value caption="TOGGLE" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__AEEVT">
        <value caption="NONE" name="NONE" value="0x0"/>
        <value caption="SET" name="SET" value="0x1"/>
        <value caption="CLEAR" name="CLEAR" value="0x2"/>
        <value caption="TOGGLE" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__ASWTRG">
        <value caption="NONE" name="NONE" value="0x0"/>
        <value caption="SET" name="SET" value="0x1"/>
        <value caption="CLEAR" name="CLEAR" value="0x2"/>
        <value caption="TOGGLE" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__BCPB">
        <value caption="NONE" name="NONE" value="0x0"/>
        <value caption="SET" name="SET" value="0x1"/>
        <value caption="CLEAR" name="CLEAR" value="0x2"/>
        <value caption="TOGGLE" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__BCPC">
        <value caption="NONE" name="NONE" value="0x0"/>
        <value caption="SET" name="SET" value="0x1"/>
        <value caption="CLEAR" name="CLEAR" value="0x2"/>
        <value caption="TOGGLE" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__BEEVT">
        <value caption="NONE" name="NONE" value="0x0"/>
        <value caption="SET" name="SET" value="0x1"/>
        <value caption="CLEAR" name="CLEAR" value="0x2"/>
        <value caption="TOGGLE" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__BSWTRG">
        <value caption="NONE" name="NONE" value="0x0"/>
        <value caption="SET" name="SET" value="0x1"/>
        <value caption="CLEAR" name="CLEAR" value="0x2"/>
        <value caption="TOGGLE" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR1__TCCLKS">
        <value caption="Clock selected: internal MCK/2 clock signal (from PMC)" name="TIMER_CLOCK1" value="0x0"/>
        <value caption="Clock selected: internal MCK/8 clock signal (from PMC)" name="TIMER_CLOCK2" value="0x1"/>
        <value caption="Clock selected: internal MCK/32 clock signal (from PMC)" name="TIMER_CLOCK3" value="0x2"/>
        <value caption="Clock selected: internal MCK/128 clock signal (from PMC)" name="TIMER_CLOCK4" value="0x3"/>
        <value caption="Clock selected: internal SLCK clock signal (from PMC)" name="TIMER_CLOCK5" value="0x4"/>
        <value caption="Clock selected: XC0" name="XC0" value="0x5"/>
        <value caption="Clock selected: XC1" name="XC1" value="0x6"/>
        <value caption="Clock selected: XC2" name="XC2" value="0x7"/>
      </value-group>
      <value-group caption="" name="TC_CMR1__BURST">
        <value caption="The clock is not gated by an external signal." name="NONE" value="0x0"/>
        <value caption="XC0 is ANDed with the selected clock." name="XC0" value="0x1"/>
        <value caption="XC1 is ANDed with the selected clock." name="XC1" value="0x2"/>
        <value caption="XC2 is ANDed with the selected clock." name="XC2" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR1__ETRGEDG">
        <value caption="The clock is not gated by an external signal." name="NONE" value="0x0"/>
        <value caption="Rising edge" name="RISING" value="0x1"/>
        <value caption="Falling edge" name="FALLING" value="0x2"/>
        <value caption="Each edge" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR1__LDRA">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Rising edge of TIOA" name="RISING" value="0x1"/>
        <value caption="Falling edge of TIOA" name="FALLING" value="0x2"/>
        <value caption="Each edge of TIOA" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR1__LDRB">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Rising edge of TIOA" name="RISING" value="0x1"/>
        <value caption="Falling edge of TIOA" name="FALLING" value="0x2"/>
        <value caption="Each edge of TIOA" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR1__SBSMPLR">
        <value caption="Load a Capture Register each selected edge" name="ONE" value="0x0"/>
        <value caption="Load a Capture Register every 2 selected edges" name="HALF" value="0x1"/>
        <value caption="Load a Capture Register every 4 selected edges" name="FOURTH" value="0x2"/>
        <value caption="Load a Capture Register every 8 selected edges" name="EIGHTH" value="0x3"/>
        <value caption="Load a Capture Register every 16 selected edges" name="SIXTEENTH" value="0x4"/>
      </value-group>
