Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.8.197/samg53/atdf/ATSAMG53N19.atdf
        <register caption="Receive Holding Register" name="UART_RHR" offset="0x0018" rw="R" size="4">
          <bitfield caption="Received Character" mask="0x000000FF" name="RXCHR"/>
        </register>
        <register caption="Transmit Holding Register" name="UART_THR" offset="0x001C" rw="W" size="4">
          <bitfield caption="Character to be Transmitted" mask="0x000000FF" name="TXCHR"/>
        </register>
        <register caption="Baud Rate Generator Register" name="UART_BRGR" offset="0x0020" rw="RW" size="4">
          <bitfield caption="Clock Divisor" mask="0x0000FFFF" name="CD"/>
        </register>
        <register caption="Comparison Register" name="UART_CMPR" offset="0x0024" rw="RW" size="4">
          <bitfield caption="First Comparison Value for Received Character" mask="0x000000FF" name="VAL1"/>
          <bitfield caption="Comparison Mode" mask="0x00001000" name="CMPMODE" values="UART_CMPR__CMPMODE"/>
          <bitfield caption="Compare Parity" mask="0x00004000" name="CMPPAR"/>
          <bitfield caption="Second Comparison Value for Received Character" mask="0x00FF0000" name="VAL2"/>
        </register>
        <register caption="Write Protection Mode Register" name="UART_WPMR" offset="0x00E4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="UART_WPMR__WPKEY"/>
        </register>
        <register caption="Receive Pointer Register" name="UART_RPR" offset="0x100" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register" name="UART_RCR" offset="0x104" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
        <register caption="Transmit Pointer Register" name="UART_TPR" offset="0x108" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0xFFFFFFFF" name="TXPTR"/>
        </register>
        <register caption="Transmit Counter Register" name="UART_TCR" offset="0x10C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0x0000FFFF" name="TXCTR"/>
        </register>
        <register caption="Receive Next Pointer Register" name="UART_RNPR" offset="0x110" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="UART_RNCR" offset="0x114" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transmit Next Pointer Register" name="UART_TNPR" offset="0x118" rw="RW" size="4">
          <bitfield caption="Transmit Next Pointer" mask="0xFFFFFFFF" name="TXNPTR"/>
        </register>
        <register caption="Transmit Next Counter Register" name="UART_TNCR" offset="0x11C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Next" mask="0x0000FFFF" name="TXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="UART_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Receiver Circular Buffer Disable" mask="0x00020000" name="RXCBDIS"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Disable" mask="0x00080000" name="TXCBDIS"/>
          <bitfield caption="Transfer Bus Error Clear" mask="0x01000000" name="ERRCLR"/>
        </register>
        <register caption="Transfer Status Register" name="UART_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transfer Bus Error" mask="0x01000000" name="ERR"/>
        </register>
      </register-group>
      <value-group caption="" name="UART_MR__FILTER">
        <value caption="UART does not filter the receive line." name="DISABLED" value="0"/>
        <value caption="UART filters the receive line using a three-sample filter (16x-bit clock) (2 over 3 majority)." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="UART_MR__PAR">
        <value caption="Even Parity" name="EVEN" value="0x0"/>
        <value caption="Odd Parity" name="ODD" value="0x1"/>
        <value caption="Space: parity forced to 0" name="SPACE" value="0x2"/>
        <value caption="Mark: parity forced to 1" name="MARK" value="0x3"/>
        <value caption="No parity" name="NO" value="0x4"/>
      </value-group>
      <value-group caption="" name="UART_MR__CHMODE">
        <value caption="Normal mode" name="NORMAL" value="0x0"/>
        <value caption="Automatic echo" name="AUTOMATIC" value="0x1"/>
        <value caption="Local loopback" name="LOCAL_LOOPBACK" value="0x2"/>
        <value caption="Remote loopback" name="REMOTE_LOOPBACK" value="0x3"/>
      </value-group>
      <value-group caption="" name="UART_CMPR__CMPMODE">
        <value caption="Any character is received and comparison function drives CMP flag." name="FLAG_ONLY" value="0"/>
        <value caption="Comparison condition must be met to start reception." name="START_CONDITION" value="1"/>
      </value-group>
      <value-group caption="" name="UART_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation.Always reads as 0." name="PASSWD" value="0x554152"/>
      </value-group>
    </module>
    <module name="USART" caption="Universal Synchronous Asynchronous Receiver Transmitter" id="6089" version="ZN">
      <register-group name="USART">
        <register caption="Control Register" name="US_CR" offset="0x0000" rw="W" size="4">
          <mode name="USART" caption="USART" qualifier="US_MR.USART_MODE"/>
          <mode name="SPI" caption="SPI" qualifier="US_MR.USART_MODE"/>
          <bitfield modes="USART" caption="Reset Receiver" mask="0x00000004" name="RSTRX"/>
          <bitfield modes="USART" caption="Reset Transmitter" mask="0x00000008" name="RSTTX"/>
          <bitfield modes="USART" caption="Receiver Enable" mask="0x00000010" name="RXEN"/>
          <bitfield modes="USART" caption="Receiver Disable" mask="0x00000020" name="RXDIS"/>
          <bitfield modes="USART" caption="Transmitter Enable" mask="0x00000040" name="TXEN"/>
          <bitfield modes="USART" caption="Transmitter Disable" mask="0x00000080" name="TXDIS"/>
          <bitfield modes="USART" caption="Reset Status Bits" mask="0x00000100" name="RSTSTA"/>
          <bitfield modes="USART" caption="Start Break" mask="0x00000200" name="STTBRK"/>
          <bitfield modes="USART" caption="Stop Break" mask="0x00000400" name="STPBRK"/>
          <bitfield modes="USART" caption="Clear TIMEOUT Flag and Start Timeout After Next Character Received" mask="0x00000800" name="STTTO"/>
          <bitfield modes="USART" caption="Send Address" mask="0x00001000" name="SENDA"/>
          <bitfield modes="USART" caption="Start Timeout Immediately" mask="0x00008000" name="RETTO"/>
          <bitfield modes="USART" caption="Request to Send Enable" mask="0x00040000" name="RTSEN"/>
          <bitfield modes="USART" caption="Request to Send Disable" mask="0x00080000" name="RTSDIS"/>
          <bitfield modes="SPI" caption="Reset Receiver" mask="0x00000004" name="RSTRX"/>
          <bitfield modes="SPI" caption="Reset Transmitter" mask="0x00000008" name="RSTTX"/>
          <bitfield modes="SPI" caption="Receiver Enable" mask="0x00000010" name="RXEN"/>
          <bitfield modes="SPI" caption="Receiver Disable" mask="0x00000020" name="RXDIS"/>
          <bitfield modes="SPI" caption="Transmitter Enable" mask="0x00000040" name="TXEN"/>
          <bitfield modes="SPI" caption="Transmitter Disable" mask="0x00000080" name="TXDIS"/>
          <bitfield modes="SPI" caption="Reset Status Bits" mask="0x00000100" name="RSTSTA"/>
          <bitfield modes="SPI" caption="Force SPI Chip Select" mask="0x00040000" name="FCS"/>
          <bitfield modes="SPI" caption="Release SPI Chip Select" mask="0x00080000" name="RCS"/>
        </register>
        <register caption="Mode Register" name="US_MR" offset="0x0004" rw="RW" size="4">
          <mode name="USART" caption="USART" qualifier="US_MR.USART_MODE"/>
          <mode name="SPI" caption="SPI" qualifier="US_MR.USART_MODE"/>
          <bitfield modes="USART" caption="USART Mode of Operation" mask="0x0000000F" name="USART_MODE" values="US_MR__USART_MODE"/>
          <bitfield modes="USART" caption="Clock Selection" mask="0x00000030" name="USCLKS" values="US_MR__USCLKS"/>
          <bitfield modes="USART" caption="Character Length" mask="0x000000C0" name="CHRL" values="US_MR__CHRL"/>
          <bitfield modes="USART" caption="Synchronous Mode Select" mask="0x00000100" name="SYNC"/>
          <bitfield modes="USART" caption="Parity Type" mask="0x00000E00" name="PAR" values="US_MR__PAR"/>
          <bitfield modes="USART" caption="Number of Stop Bits" mask="0x00003000" name="NBSTOP" values="US_MR__NBSTOP"/>
          <bitfield modes="USART" caption="Channel Mode" mask="0x0000C000" name="CHMODE" values="US_MR__CHMODE"/>
          <bitfield modes="USART" caption="9-bit Character Length" mask="0x00020000" name="MODE9"/>
          <bitfield modes="USART" caption="Clock Output Select" mask="0x00040000" name="CLKO"/>
          <bitfield modes="USART" caption="Oversampling Mode" mask="0x00080000" name="OVER"/>
          <bitfield modes="USART" caption="Receive Line Filter" mask="0x10000000" name="FILTER"/>
          <bitfield modes="SPI" caption="USART Mode of Operation" mask="0x0000000F" name="USART_MODE" values="US_MR__USART_MODE"/>
          <bitfield modes="SPI" caption="Clock Selection" mask="0x00000030" name="USCLKS" values="US_MR__USCLKS"/>
          <bitfield modes="SPI" caption="Character Length" mask="0x000000C0" name="CHRL" values="US_MR__CHRL"/>
          <bitfield modes="SPI" caption="Clock Output Select" mask="0x00040000" name="CLKO"/>
          <bitfield modes="SPI" caption="SPI Clock Phase" mask="0x00000100" name="CPHA"/>
          <bitfield modes="SPI" caption="SPI Clock Polarity" mask="0x00010000" name="CPOL"/>
          <bitfield modes="SPI" caption="Wait Read Data Before Transfer" mask="0x00100000" name="WRDBT"/>
        </register>
